let first = parseInt(+prompt('Введите первое число'), 10);
let second = parseInt(+prompt('Введите второе число'), 10);

if (first > second) {
    first > second === first > second ? alert(first) : alert(second);
}
else {
    alert(second)
}
//--------------------------------------------------------------------------

// я так и не понял как выполнить выполнить второе задание

//-------------------------------------------------------------------------------------
let planet = prompt('Введите название планеты');
if (planet) {
    planet === 'Земля' ? alert('Привет,землянин!') : alert('Привет, инопланетянин!');
} else {
    alert('Привет, инопланетянин!')
}
